---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralElevationAtTopSurvey
source: html/1324e023-7ded-9bbf-6cc5-c8c996a99b29.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralElevationAtTopSurvey Property

"Elevation at Top Survey"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralElevationAtTopSurvey { get; }
```